// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

// Задача 7 HARD по желанию - идет за 2 обязательных Напишите программу, которая принимает на вход целое число любой разрядности и на выходе показывает третью цифру слева этого числа или говорит, что такой цифры нет. Через строку решать нельзя.
// 456111 -> 6
// 78 -> нет
// 9146548 -> 4
// 3 -> нет


{
        Console.Write("Введите целое число a: ");
        int numbera = Convert.ToInt32(Console.ReadLine());

        Console.Write("Введите целое число b: ");
        int numberb = Convert.ToInt32(Console.ReadLine());

        if (numbera > numberb)
        {
            Console.WriteLine($"Большее число: {numbera}, Меньшее число: {numberb}");
        }
        else if (numbera < numberb)
        {
            Console.WriteLine($"Большее число: {numberb}, Меньшее число: {numbera}");
        }
        else
        {
            Console.WriteLine("Числа равны");
        }
}